Repository: KDE/kwin
Catalog: po/*/kcm_kwinxwayland.po
Languages: lt, pt, zh_cn

# @info
source: Changes will take effect the next time you log in.
lt: Pakeitimai įsigalios, kai kitą kartą prisijungsite.
pt: As alterações terão efeito na próxima vez que iniciar sessão.
zh_cn: 更改将在下次登录时生效。

# @action:button
source: Log Out Now
lt: Atsijungti dabar
pt: Terminar sessão agora
zh_cn: 立即注销

# @info:usagetip
source: Legacy X11 apps with global shortcuts and other features accessed while running in the background need to be able to listen for keystrokes all the time.<nl/><nl/>If you use any of these apps, you can choose your preferred balance of security and compatibility here.
lt: Pasenusios X11 programos naudojančios visuotinius sparčiuosius klavišus bei kitas ypatybes, kurios pasiekiamos programoms veikiant fone, turi turėti galimybę visą laiką klausytis klavišų paspaudimų.<nl/><nl/>Jeigu naudojate kažkurią iš tų programų, čia galite pasirinkti pageidaujamą saugumo ir suderinamumo pusiausvyrą.
pt: As aplicações legado X11 com atalhos globais e outras funcionalidades acedidas enquanto são executadas em segundo plano, precisam de conseguir escutar as teclas premidas constantemente.<nl/><nl/>Se utilizar alguma destas aplicações, pode escolher aqui o seu equilíbrio preferido entre segurança e compatibilidade.
zh_cn: 旧式 X11 应用程序在后台运行时，为了正常使用全局快捷键和其他功能，它们必须能够始终监听按键。<nl/><nl/>如果您正在使用这类应用程序，可在此处的设置中对安全性和兼容性进行权衡。

# @title:group
source: Listening for keystrokes:
lt: Klavišų paspaudimų klausymasis:
pt: A escutar batimentos de teclas:
zh_cn: 监听按键：

# @option:radio Listening for keystrokes is prohibited
source: Prohibited
lt: Draudžiamas
pt: Proibido
zh_cn: 禁止

# @info:usagetip
source: Most secure; global shortcuts will not work in X11 apps
lt: Saugiausia; visuotiniai spartieji klavišai neveiks X11 programose
pt: Segurança máxima; os atalhos globais não funcionarão em aplicações X11
zh_cn: 安全性最高；全局快捷键在 X11 应用程序中无法使用

# @option:radio Listening for keystrokes is allowed for…
source: Only the Meta, Control, Alt, and Shift keys
lt: Tik Meta, Vald, Alt ir Lyg2 klavišus
pt: Apenas as teclas Meta, Control, Alt e Shift
zh_cn: 仅 Meta、Ctrl、Alt、Shift 键

# @info:usagetip
source: High security; push-to-talk and other modifier-only global shortcuts will work in X11 apps
lt: Labai saugu; X11 programose veiks aktyvavimas mygtuko paspaudimu (PTT) ir kiti tik modifikatoriaus visuotiniai spartieji klavišai
pt: Segurança elevada; as teclas 'push-to-talk' e outros atalhos globais com teclas modificadoras funcionarão em aplicações X11
zh_cn: 安全性较高；一键通话等仅涉及修饰键的全局快捷键可在 X11 应用程序中使用

# @option:radio Listening for keystrokes is allowed for…
source: As above, plus any key pressed while the Control, Alt, or Meta key is also pressed
lt: Tas pats, kaip aukščiau ir dar papildomai bet kuriuos klavišus, kurie paspaudžiami laikant nuspaustą Vald, Alt ar Meta klavišą
pt: Como acima, mais qualquer tecla premida enquanto as teclas Control, Alt ou Meta também estiverem premidas
zh_cn: 和上面一样，加上按住 Ctrl、Alt、Meta 等修饰键时按下的任何按键

# @info:usagetip
source: Moderate security; all global shortcuts will work in X11 apps
lt: Vidutiniškai saugu; X11 programose veiks visi visuotiniai spartieji klavišai
pt: Segurança moderada; todos os atalhos globais funcionarão em aplicações X11
zh_cn: 安全性一般；所有全局快捷键在 X11 应用程序中均可使用

# @option:radio Listening for keystrokes is always allowed
source: Always allowed
lt: Visada leidžiamas
pt: Sempre permitido
zh_cn: 始终允许

# @info:usagetip
source: Least secure; all X11 apps will be able to see any text you type into any application
lt: Nesaugiausia; visos X11 programos galės matyti visą bet kurioje programoje rašomą tekstą
pt: Segurança mínima; todas as aplicações X11 poderão ver qualquer texto que escreva em qualquer aplicação
zh_cn: 安全性最差；所有 X11 应用程序均可监听您在任意应用程序中输入的任意文本

# @info:usagetip
source: Note that using this setting will reduce system security and permit malicious software to steal passwords and spy on the text that you type. Make sure you understand and accept this risk.
lt: Turėkite omenyje, kad naudojant šią nuostatą, sistemos saugumas sumažės, o kenkėjiškai programinei įrangai atsiras galimybė vogti jūsų slaptažodžius ir šnipinėti renkamą tekstą. Įsitikinkite, kad suvokiate šią riziką ir sutinkate ją prisiimti.
pt: Note que a utilização desta definição irá reduzir a segurança do sistema e permitir que 'software' malicioso roube palavras-passe e espie o texto que escreve. Certifique-se de que compreende e aceita este risco.
zh_cn: 请注意：使用此设置会降低系统安全性，使得恶意软件能够窃取密码并监听您输入的文本。请确保您已了解并接受此风险。

# @title:group
source: Listening for mouse buttons:
lt: Pelės mygtukų spustelėjimų klausymasis:
pt: A escutar botões do rato:
zh_cn: 监听鼠标键：

# @option:radio Listening for mouse buttons is allowed
source: Allowed
lt: Leidžiamas
pt: Permitido
zh_cn: 允许

# @info:usagetip
source: Moderate security; global shortcuts involving mouse buttons will work in X11 apps
lt: Vidutiniškai saugu; X11 programose veiks visuotiniai klavišai, kuriuose naudojami pelės mygtukai
pt: Segurança moderada; os atalhos globais que envolvam botões do rato funcionarão em aplicações X11
zh_cn: 安全性一般；涉及鼠标键的全局快捷键在 X11 应用程序中可以使用

# @title:group
source: Control of pointer and keyboard:
lt: Rodyklės ir klaviatūros valdymas:
pt: Controlo do ponteiro e do teclado:
zh_cn: 控制指针和键盘：

source: Allow without asking for permission
lt: Leidžiamas neprašant leidimo
pt: Permitir sem pedir permissão
zh_cn: 允许控制，无需询问用户授权

# @info:usagetip
source: Least secure; all X11 apps will be able to take control of the computer
lt: Nesaugiausia; visos X11 programos galės perimti kompiuterio valdymą
pt: Segurança mínima; todas as aplicações X11 poderão assumir o controlo do computador
zh_cn: 安全性最差；所有 X11 应用程序均可控制此计算机

# @info:usagetip
source: Note that using this setting will drastically reduce system security and permit malicious software to take complete control of your pointer and keyboard. Make sure you understand and accept this risk.
lt: Turėkite omenyje, kad naudojant šią nuostatą, ženkliai sumažės sistemos saugumas, o kenkėjiškai programinei įrangai atsiras galimybė perimti visišką pelės rodyklės ir klaviatūros valdymą. Įsitikinkite, kad suvokiate šią riziką ir sutinkate ją prisiimti.
pt: Note que a utilização desta definição irá reduzir drasticamente a segurança do sistema e permitir que 'software' malicioso assuma o controlo total do seu ponteiro do rato e teclado. Certifique-se de que compreende e aceita este risco.
zh_cn: 请注意：使用此设置将极大地降低系统安全性，使得恶意软件能够完全控制您的鼠标和键盘。请确保您已了解并接受此风险。
