Repository: KDE/kwin
Catalog: po/*/kcm_kwin_effects.po
Languages: he

# NAME OF TRANSLATORS
source: Your names
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
he: kde-l10n-he@kde.org

source: Desktop Effects
he: אפקטים של שולחן עבודה

source: Vlad Zahorodnii
he: ולאד זהורודני

source: Author: %1 License: %2
he: יוצר: %1 רישיון: %2

# @info:tooltip
source: Show/Hide Video
he: הצגת/הסתרת סרטון

# @info:tooltip
source: Configure...
he: הגדרה…

source: This module lets you configure desktop effects.
he: המודול הזה מאפשר לך להגדיר אפקטים בשולחן העבודה.

source: Hint: To find out or configure how to activate an effect, look at the effect's settings.
he: רמז: כדי למצוא או להגדיר איך להפעיל אפקט, כדאי להציץ בהגדרות האפקט.

source: Configure Filter
he: הגדרת מסנן

source: Exclude unsupported effects
he: החרגת אפקטים שלא נתמכים

source: Exclude internal effects
he: החרגת אפקטים חיצוניים
