Repository: KDE/kwin
Catalog: po/*/kcm_kwindecoration.po
Languages: pt, ug

source: Window menu
pt: Menu de janela
ug: كۆزنەك تىزىملىكى

source: Application menu
pt: Menu de aplicação
ug: پىروگرامما تىزىملىكى

source: On all desktops
pt: Em todos os ambientes de trabalho
ug: ھەممە ئۈستەلئۈستىدە

source: Minimize
pt: Minimizar
ug: كىچىكلەت

source: Maximize
pt: Maximizar
ug: چوڭايت

source: Close
pt: Fechar
ug: ياپ

source: Context help
pt: Ajuda contextual
ug: مەزمۇن ياردەم

source: Keep below other windows
pt: Manter por baixo de outras janelas
ug: باشقا كۆزنەكنىڭ ئاستىدا تۇتىدۇ

source: Keep above other windows
pt: Manter por cima de outras janelas
ug: باشقا كۆزنەكنىڭ ئۈستىدە تۇتىدۇ

source: Hide from screencast
pt: Ocultar da gravação de ecrã
ug: ئېكران تارقىتىشتىن يوشۇر

source: Spacer
pt: Separador
ug: بوشلۇق

# %1 is the name of a border size
source: Theme default (%1)
pt: Predefinição do tema (%1)
ug: ئۆرنەك كۆڭۈلدىكى (%1)

source: This tool allows you to set the window decoration theme for the currently active session, without accidentally setting it to one that is either not available, or which is already set.
pt: Esta ferramenta permite definir o tema da decoração de janelas para a sessão ativa, sem o definir acidentalmente para um tema que não esteja disponível ou que já esteja definido.
ug: بۇ قورال نۆۋەتتىكى ئاكتىپ جەريانچاقنىڭ بېزەك ئۆرنىكىنى تەڭشەشكە ئىشلىتىلىدۇ، ئۇنى ئىشلەتكىلى بولمايدىغان قىلىپ تەڭشەش ياكى ئىشلىتىلىۋاتقان ئۆرنەك قىلىپ تەڭشەشتىن ساقلىنىدۇ.

source: The name of the window decoration theme you wish to set for KWin. Passing a full path will attempt to find a theme in that directory, and then apply that if one can be deduced.
pt: O nome do tema da decoração de janelas que pretende definir para o KWin. Se for passado um caminho completo, será tentada a localização de um tema nessa pasta, que será aplicado se puder ser deduzido.
ug: تەڭشەيدىغان KWin كۆزنەك بېزەك ئۆرنىكىنىڭ ئىسمى. تولۇق يولى بېرىلسە شۇ يولدىكى مۇندەرىجىدىن ئۆرنەكنى ئىزدەيدۇ ۋە ئۆرنەك بەلگىلىگەن ئىسىم ئىشلىتىلىدۇ.

source: Show all the themes available on the system (and which is the current theme)
pt: Mostrar todos os temas disponíveis no sistema (e qual é o tema atual)
ug: سىستېمىدا ئىشلەتكىلى بولىدىغان ھەممە ئۆرنەك (ۋە قايسىسىنىڭ نۆۋەتتە ئىشلىتىلىۋاتقىنى ئىكەنلىكى) نى كۆرسىتىدۇ

source: Resolved %1 to the KWin Aurorae theme "%2", and will attempt to set that as your current theme.
pt: Foi resolvido %1 para o tema KWin Aurorae "%2", e será tentada a sua definição como tema atual.
ug: %1 نى KWin Aurorae ئۆرنىكى «%2» دەپ يېشىدۇ ۋە نۆۋەتتىكى ئۆرنىكىڭىزگە تەڭشەشكە تىرىشىدۇ.

source: You attempted to pass a file path, but this could not be resolved to a theme, and we will have to abort, due to having no theme to set
pt: Foi tentado passar um caminho de ficheiro, mas este não pôde ser resolvido para um tema, e teremos de abortar, por não haver tema a definir.
ug: سىز ھۆججەت يولىنى يەتكۈزمەكچى بولدىڭىز ئەمما بۇ يولدىكى ئۆرنەكنى يېشەلمىدى ۋە تەڭشەيدىغان ئۆرنەك بولمىغانلىق سەۋەبىدىن نۆۋەتتىكى مەشغۇلاتتىن چېكىنىدۇ

source: The requested theme "%1" is already set as the window decoration theme.
pt: O tema solicitado "%1" já está definido como tema da decoração de janelas.
ug: ئىلتىماس قىلىنغان ئۆرنەك «%1» ئاللىبۇرۇن كۆزنەك بېزەك ئۆرنىكىگە تەڭشەلگەن.

source: Successfully applied the cursor theme %1 to your current Plasma session
pt: O tema de cursor %1 foi aplicado com sucesso à sua sessão Plasma atual.
ug: نۇر بەلگە ئۆرنىكى «%1» نۆۋەتتىكى Plasma جەريانچاققا مۇۋەپپەقىيەتلىك قوللىنىلدى

source: Failed to save your theme settings - the reason is unknown, but this is an unrecoverable error. You may find that simply trying again will work.
pt: Falha ao guardar as definições do tema – a razão é desconhecida, mas este é um erro irrecuperável. Poderá ser que tentar novamente simplesmente funcione.
ug: ئۆرنەك تەڭشىكىنى ساقلىيالمىدى - سەۋەبى ئېنىق ئەمەس، ئەمما ئەسلىگە كەلتۈرگىلى بولمايدىغان خاتالىق. ئۇنى قايتا سىناپ باقسىڭىز مەسىلە ھەل بولۇشى مۇمكىن.

source: Could not find theme "%1". The theme should be one of the following options: %2
pt: Não foi possível encontrar o tema "%1". O tema deverá ser uma das seguintes opções: %2
ug: «%1» ئۆرنەكنى تاپالمىدى. ئۆرنەك تۆۋەندىكى تاللانمىدىن بىرى بولۇشى كېرەك: %2

source: You have the following KWin window decoration themes on your system:
pt: Dispõe dos seguintes temas de decoração de janelas do KWin no seu sistema:
ug: سىستېمىڭىزدا تۆۋەندىكى KWin كۆزنەك بېزەك ئۆرنىكى بار:

source: Titlebar
pt: Barra de título
ug: ماۋزۇ بالداق

source: Drop button here to remove it
pt: Largue o botão aqui para o remover
ug: توپچە بۇ جايغا تاشلانسا چىقىرىۋېتىدۇ

source: Drag buttons between here and the titlebar
pt: Arraste os botões entre a barra de título e aqui
ug: توپچە بۇ جاي بىلەن ماۋزۇ بالداق ئارىسىدا سۆرىلىدۇ

source: Titlebar Buttons
pt: Botões da barra de título
ug: ماۋزۇ بالداق توپچە

# checkbox label
source: Close windows by double clicking the window menu button
pt: Fechar janelas ao clicar duas vezes no botão do menu da janela
ug: كۆزنەك تىزىملىك توپچە قوش چېكىلسە كۆزنەكنى ياپىدۇ

# popup tip
source: Click and hold on the window menu button to show the menu.
pt: Clique e mantenha premido no botão do menu da janela para mostrar o menu.
ug: تىزىملىك كۆرسىتىشتە كۆزنەك تىزىملىكىنى چېكىپ بېسىپ تۇرۇلىدۇ.

# checkbox label
source: Show titlebar button tooltips
pt: Mostrar dicas dos botões da barra de título
ug: ماۋزۇ بالداق توپچە قورال ئەسكەرتىشىنى كۆرسىتىدۇ

# @option:check
source: Always show "Hide from Screencast" button
pt: Mostrar sempre o botão "Ocultar da gravação de ecrã"

# @info:tooltip
source: When unchecked the button only appears if the window is hidden from screencast
pt: Quando desmarcada, o botão só aparece se a janela estiver oculta da gravação de ecrã
ug: ئەگەر كۆزنەك ئېكران تارقىتىشتىن يوشۇرۇلغان بولسا، توپچە چېكىلمىگەندە ئاندىن كۆرۈنىدۇ

# @info:tooltip
source: To enable this option, add the "Hide from screencast" button to the titlebar first
pt: Para ativar esta opção, adicione primeiro o botão "Ocultar da gravação de ecrã" à barra de título
ug: بۇ تاللانمىنى قوزغىتىشتا، ئالدى بىلەن ماۋزۇ بالداققا «ئېكران تارقىتىشتىن يوشۇر» توپچە قوشۇلۇشى كېرەك

# Selector label
source: Window border size:
pt: Tamanho da borda da janela:
ug: كۆزنەك گىرۋەك چوڭلۇقى:

# button text
source: Configure Titlebar Buttons…
pt: Configurar botões da barra de título…
ug: ماۋزۇ بالداق توپچە سەپلىمىسى…

# @action:button as in, "Get New Window Decorations"
source: Get New…
pt: Obter novos…
ug: يېڭىسىغا ئېرىش…

source: Edit %1 Theme…
pt: Editar tema %1…
ug: %1 ئۆرنەك تەھرىر…

source: No window borders
pt: Sem bordas de janela
ug: كۆزنەك گىرۋىكى يوق

source: No side window borders
pt: Sem bordas laterais da janela
ug: كۆزنەك گىرۋەك يېنى يوق

source: Tiny window borders
pt: Bordas de janela minúsculas
ug: كىچىك كۆزنەك گىرۋىكى

source: Normal window borders
pt: Bordas de janela normais
ug: ئادەتتىكى كۆزنەك گىرۋىكى

source: Large window borders
pt: Bordas de janela grandes
ug: چوڭ كۆزنەك گىرۋىكى

source: Very large window borders
pt: Bordas de janela muito grandes
ug: ئىنتايىن چوڭ كۆزنەك گىرۋىكى

source: Huge window borders
pt: Bordas de janela enormes
ug: زور كۆزنەك گىرۋىكى

source: Very huge window borders
pt: Bordas de janela gigantescas
ug: ئىنتايىن زور كۆزنەك گىرۋىكى

source: Oversized window borders
pt: Bordas de janela de tamanho exagerado
ug: ئۆتە چوڭ كۆزنەك گىرۋىكى
