Repository: KDE/kwin
Catalog: po/*/kcm_kwin_virtualdesktops.po
Languages: is

# NAME OF TRANSLATORS
source: Your names
is: Sveinn í Felli, Guðmundur Erlingsson

# EMAIL OF TRANSLATORS
source: Your emails
is: sv1@fellsnet.is, gudmundure@gmail.com

# A numbered name for virtual desktops
source: Desktop %1
is: Skjáborð %1

source: There was an error connecting to the compositor.
is: Villa kom upp við að tengjast skjásamsetningunni.

source: There was an error saving the settings to the compositor.
is: Villa kom upp við vistun á stillingum fyrir skjásamsetninguna.

source: There was an error requesting information from the compositor.
is: Villa kom upp þegar beðið var um upplýsingar frá skjásamsetningunni.

# @text:label Number of rows, label associated to a number input field
source: Rows:
is: Raðir:

# @action:button
source: Add Desktop
is: Bæta við skjáborði

# @info:tooltip
source: Remove
is: Fjarlægja

source: Virtual desktops have been changed outside this settings application. Saving now will overwrite the changes.
is: Sýndarskjáborðum var breytt annars staðar en í þessu stillingaforriti. Ef þú vistar núna glatast þær breytingar.

source: Row %1
is: Röð %1

source: Options:
is: Valkostir:

source: Navigation wraps around
is: Fletting fer hringinn

source: Show animation when switching:
is: Sýna hreyfiáhrif þegar skipt er á milli:

source: Show on-screen display when switching:
is: Sýna yfirlagsmynd á skjá þegar skipt er á milli:

source: %1 ms
is: %1 msek.

source: Show desktop layout indicators
is: Sýna táknvísa fyrir framsetningu skjáborðs
