Repository: KDE/kwin
Catalog: po/*/kcm_kwin_scripts.po
Languages: ga

# NAME OF TRANSLATORS
source: Your names
ga: Kevin Scannell,Charlotte

# EMAIL OF TRANSLATORS
source: Your emails
ga: kscanne@gmail.com,altronic25@protonmail.com

source: Import KWin Script
ga: Iompórtáil Script KWin...

source: *.kwinscript|KWin scripts (*.kwinscript)
ga: *.kwinscript|Scripteanna KWin (*.kwinscript)

# Placeholder is error message returned from the install service
source: Cannot import selected script. %1
ga: Níl féidir script roghnaithe a iompórtáil. %1

# Placeholder is name of the script that was imported
source: The script "%1" was successfully imported.
ga: Bhí an script "%1" go rathúil ag iompórtáilte.

source: Error when uninstalling KWin Script: %1
ga: Earráid nuair Script KWin á dhíshuiteáil: %1

# @info:tooltip
source: Delete...
ga: Scrios...

source: Install from File...
ga: Suiteáil ó Chomhaid...

source: Get New Scripts...
ga: Faigh Scripteanna Nua...
