Repository: KDE/kwin
Catalog: po/*/kcm_animations.po
Languages: is

# @item:inlistbox
source: None
is: Ekkert

source: Global animation speed:
is: Almennur hraði myndhreyfinga:

# @info:tooltip
source: Some applications do not support this setting: In particular, GTK applications cannot change animation duration, but will still disable animations when <interface>animation speed</interface> is <interface>Instant</interface>.
is: Sum forrit styðja ekki þessa stillingu: Sérstaklega eru það GTK-forrit sem ekki geta breytt tímalengd myndhreyfinga, en munu samt gera myndhreyfingar óvirkar þegar <interface>hraði myndhreyfinga</interface> er stilltur á <interface>Samstundis</interface>.

# Animation speed
source: Slow
is: Hægt

# Animation speed
source: Instant
is: Samstundis

# @title:group
source: Desktop animations
is: Myndhreyfingar skjáborðs

# @label:listbox
source: Window open/close:
is: Gluggi opnast/lokast:

# @label:listbox
source: Window maximize:
is: Gluggi hámarkaður:

# @label:listbox
source: Window minimize:
is: Gluggi lágmarkaður:

# @label:listbox
source: Window full screen:
is: Gluggi í skjáfylli:

# @label:listbox
source: Peek at desktop:
is: Kíkja á skjáborð:

# @label:listbox
source: Virtual desktop switching:
is: Skipting milli sýndarskjáborða:

# @info:tooltip
source: Configure…
is: Grunnstilla…

# @title:group translate as short as possible
source: More effects settings:
is: Fleiri stillingar sjónhrifa:
