Repository: KDE/kwin
Catalog: po/*/kcmkwincommon.po
Languages: ga

# NAME OF TRANSLATORS
source: Your names
ga: Charlotte

# EMAIL OF TRANSLATORS
source: Your emails
ga: altronic25@protonmail.com

# Category of Desktop Effects, used as section header
source: Accessibility
ga: Inrochtaineacht

# Category of Desktop Effects, used as section header
source: Appearance
ga: Cuma

# Category of Desktop Effects, used as section header
source: Focus
ga: Treoir

# Category of Desktop Effects, used as section header
source: Peek at Desktop Animation
ga: Spléach ar an Deasc Beochan

# Category of Desktop Effects, used as section header
source: Tools
ga: Uirlisí

# Category of Desktop Effects, used as section header
source: Window Management
ga: Bainisteoireacht Fuinneoige

# Category of Desktop Effects, used as section header
source: Window Open/Close Animation
ga: Oscail/Dún Fuinneoige Beochan

source: KWin development team
ga: Foireann Fhorbartha KWin

# Error message
source: Could not locate package metadata
ga: Níorbh fhéidir meiteashonraí pacáiste a aimsiú

# Required file does not exist
source: %1 does not contain a valid metadata.json file
ga: Níl metadata.json comhad bailí in %1

# Required file does not exist
source: %1 does not exist
ga: Níl %1 ann
