Repository: KDE/kwin
Catalog: po/*/kcmkwinscreenedges.po
Languages: cs, ug

source: No Action
cs: Žádná činnost
ug: مەشغۇلات يوق

source: Peek at Desktop
cs: Nakouknout na pracovní plochu
ug: ئۈستەلئۈستى كۆرسەت

source: Lock Screen
cs: Zamknout obrazovku
ug: ئېكراننى قۇلۇپلا

source: Show KRunner
cs: Zobrazit KRunner
ug: KRunner نى كۆرسەت

source: Activity Manager
cs: Správce aktivit
ug: پائالىيەت باشقۇرغۇچ

source: Application Launcher
cs: Spouštěč aplikací
ug: پىروگرامما قوزغاتقۇچ

source: Present Windows
cs: Prezentace oken
ug: كۆزنەكنى كۆرسەت

source: %1 - All Desktops
cs: %1 - Všechny plochy
ug: %1 - بارلىق ئۈستەلئۈستى

source: %1 - Current Desktop
cs: %1 - Aktuální plocha
ug: %1 - نۆۋەتتىكى ئۈستەلئۈستى

source: %1 - Current Application
cs: %1 - Aktuální aplikace
ug: %1 - نۆۋەتتىكى پىروگرامما

source: Overview
cs: Přehled
ug: ئىخچام كۆرۈنۈش

source: Grid
cs: Mřížka
ug: شادا

source: Toggle window switching
cs: Zapnout přepínání oken
ug: كۆزنەك ئالماشتۇرۇشنى ئالماشتۇر

source: Toggle alternative window switching
cs: Zapnout alternativní přepínání oken
ug: زاپاس كۆزنەك ئالماشتۇرۇشنى ئالماشتۇرىدۇ

source: You can trigger an action by pushing the mouse cursor against the corresponding screen edge or corner.
cs: Můžete spustit činnost posunutím kurzoru myši proti odpovídajícímu okraji nebo rohu.
ug: چاشقىنەك نۇر بەلگىسىنى ئېكران گىرۋىكى ياكى بۇلۇڭىغا ئىتتىرىپ بەلگىلەنگەن مەشغۇلاتنى قوزغىتالايسىز.

source: &Maximize:
cs: &Maximalizovat:
ug: چوڭايت(&M):

source: Windows dragged to top edge
cs: Okna přetažená na horní okraj
ug: كۆزنەك يۇقىرى گىرۋەككە سۆرەلدى

source: &Tile:
cs: &Dlaždice:
ug: ياي(&T):

source: Windows dragged to left or right edge
cs: Okna přetažená na levý nebo pravý okraj
ug: كۆزنەك ئوڭ ياكى سول گىرۋەككە سۆرەلدى

source: Behavior:
cs: Chování:
ug: قىلمىش:

source: Remain active when windows are fullscreen
cs: Zůstat aktivní pokud jsou okna přes celou obrazovku
ug: كۆزنەك تولۇق ئېكران بولغاندا ئاكتىپ ھالىتىنى ساقلايدۇ

source: Trigger &quarter tiling in:
cs: Spustit čtvrtinové &dlaždicování v:
ug: چارەك يېيىشنى قوزغىتىدۇ(&Q):

source: Outer
cs: Vnější
ug: سىرتقى

source: of the screen
cs: obrazovky
ug: ئېكران

source: Change desktop when the mouse cursor is pushed against the edge of the screen
cs: Změnit plochu pokud je ukazatel myši posunut k okraji obrazovky
ug: چاشقىنەك نۇر بەلگىسىنى ئېكراننىڭ گىرۋىكىگە ئىتتەرگەندە مەۋھۇم ئۈستەلئۈستىنى ئالماشتۇرىدۇ

source: &Switch desktop on edge:
cs: &Přepnout obrazovku na okraji:
ug: گىرۋەكتە ئۈستەلئۈستىنى ئالماشتۇرىدۇ(&S):

# Switch desktop on edge
source: Disabled
cs: Zakázáno
ug: چەكلەنگەن

source: Only when moving windows
cs: Pouze při pohybu oken
ug: پەقەت كۆزنەك يۆتكىگەندە ئۈستەلئۈستىنى ئالماشتۇرىدۇ

source: Always enabled
cs: Vždy povolen
ug: ھەمىشە قوزغىتىدۇ

source: Amount of time required for the mouse cursor to be pushed against the edge of the screen before the action is triggered
cs: Doba, po jakou musí být ukazatel myši posunován proti okraji obrazovky aby se spustila přidělená činnost
ug: چاشقىنەك نۇر بەلگىسىنى ئېكراننىڭ گىرۋىكىگە ئىتتەرگەندە مەشغۇلاتنى قوزغىتىشتىن ئىلگىرى كۈتىدىغان ۋاقىت

source: Activation &delay:
cs: Pro&dleva aktivace:
ug: ئاكتىپلاشنى كېچىكتۈرۈش(&D):

source: Amount of time required after triggering an action until the next trigger can occur
cs: Doba, která musí uběhnout od naposled vykonané činnosti po spuštění následující činnosti
ug: بىر مەشغۇلات قوزغىتىلغاندىن كېيىن ئۇنىڭدىن كېيىنكى مەشغۇلاتنىڭ قوزغىلىشى ئۈچۈن كۈتىدىغان ۋاقىت

source: &Reactivation delay:
cs: Prodleva &reaktivace:
ug: قايتا ئاكتىپلاشنى كېچىكتۈرۈش(&R):

source: &Corner barrier:
cs: Ro&hová bariéra:
ug: بۇلۇڭ قاشاسى(&C):

source: Here you can enable or disable the virtual corner barrier between screens. The barrier prevents the cursor from moving to another screen when it is already touching a screen corner. This makes it easier to trigger user interface elements like maximized windows' close buttons when using multiple screens.
ug: بۇ جايدا كۆپ ئېكران ئارىسىدا مەۋھۇم بۇلۇڭ قاشاسىنى قوزغىتىپ ياكى چەكلىيەلەيسىز. بۇلۇڭ قاشاسى نۇر بەلگە ئېكراننىڭ بۇلۇڭىغا تەگكەندە داۋاملىشىپ باشقا ئېكرانغا يۆتكىلىدۇ. كۆپ ئېكرانلىق مۇھىتتا، بۇ ئىقتىدار ئىشلەتكۈچىنىڭ مەلۇم كۆرۈنۈش ئېلېمېنتىنى قوزغىتىشىغا قولايلىق يارىتىدۇ، مەسىلەن، كۆزنەك ئەڭ چوڭ قىلىنغاندا كۆزنەكنى تاقاش توپچىسىنى چېكىشكە ئوخشاش.

# @info:tooltip
source: Prevents cursors from crossing at screen corners.
cs: Brání ukazateli překročit roh obrazovky.
ug: نۇر بەلگىنىڭ ئېكران بۇلۇڭىدىن ھالقىشىنىڭ ئالدىنى ئالىدۇ.

source: &Edge barrier:
ug: گىرۋەك قاشاسى(&E):

source: Here you can set size of the edge barrier between different screens. The barrier adds additional distance you have to move your pointer before it crosses the edge onto the other screen. This makes it easier to access user interface elements like Plasma Panels that are located on an edge between screens.
ug: بۇ جايدا كۆپ ئېكران ئارىسىدىكى قاشا چېگراسىنىڭ چوڭلۇقىنى تەڭشىيەلەيسىز. قاشا نىشانلىغۇچتىن چوقۇم گىرۋەكتىن مەلۇم قوشۇمچە ئارىلىق يۆتكەلسە ئاندىن باشقا ئېكرانغا يۆتكىلەلەيدىغانلىقىنى تەلەپ قىلىدۇ. كۆپ ئېكرانلىق مۇھىتتا، بۇ ئىقتىدار ئىشلەتكۈچىنىڭ Plasma كۆزنەكچىسىگە ئوخشاش ئېكران بىلەن گىرۋەك ئارىسىدىكى بەزى كۆزنەك ئېلېمېنتلارنى زىيارەت قىلىشىغا قولايلىق يارىتىدۇ.

# @info:tooltip
source: Additional distance cursor needs to travel to cross screen edges.
ug: نۇر بەلگە ئېكران گىرۋىكىدىن ئۆتۈشتىن ئىلگىرى يۆتكىلىدىغان قوشۇمچە مۇساپە.

source: None
cs: Nic
ug: يوق

source: You can trigger an action by swiping from the screen edge towards the center of the screen.
cs: Můžete spustit činnost přejetím z kraje obrazovky k jejímu středu
ug: ئېكران گىرۋىكىدىن ئېكراننىڭ مەركىزىگە سىيرىش ئارقىلىق مەشغۇلاتنى قوزغىتالايسىز.
