Repository: KDE/kwin
Catalog: po/*/kcmkwincompositing.po
Languages: bg, cs

source: OpenGL compositing (the default) has crashed KWin in the past. This was most likely due to a driver bug. If you think that you have meanwhile upgraded to a stable driver, you can reset this protection but be aware that this might result in an immediate crash!
bg: Графичните ефекти с OpenGL (по подразбиране) в миналото водеше до сривове на KWin . Това най-вероятно се дължеше на грешки в драйвера. Ако смятате, че междувременно сте надстроили до стабилен драйвер, можете да нулирате тази защита, но имайте предвид, че това може да доведе до незабавен срив! Като алтернатива, може вместо това да използвате бекенда на XRender!
cs: Kompozice OpenGL (výchozí) vedla v minulosti k pádu KWinu. K tomu nejspíš došlo kvůli chybě v ovladači. Pokud si myslíte, že jste mezitím aktualizovali na stabilní verzi ovladače, můžete resetovat ochranu, ale mějte na paměti, že to může vést k okamžitému pádu.

source: Scale method "Accurate" is not supported by all hardware and can cause performance regressions and rendering artifacts.
bg: Методът за мащабиране "Точно"не се поддържа от всеки хардуер и може да причини влошаване на производителността и изобразяване на артефакти.

source: Keeping the window thumbnail always interferes with the minimized state of windows. This can result in windows not suspending their work when minimized.
bg: Запазването на миниатюрата на прозореца винаги пречи на минимизираното състояние на прозорците. Това може да доведе до продължаване на работата на минимизираните прозорци.

source: Compositing:
bg: Графични ефекти:
cs: Kompozice:

source: Enable on startup
bg: Активиране при начално стартиране
cs: Povolit při spuštění

source: Applications can set a hint to block compositing when the window is open. This brings performance improvements for e.g. games. The setting can be overruled by window-specific rules.
bg: Приложенията могат да зададат подсказка за блокиране на графичните ефекти, когато прозорецът е отворен. Това води до подобрения в производителността за напр. игри. Настройката може да бъде отменена от специфични за прозореца правила.

source: Allow applications to block compositing
bg: Разрешаване на приложенията да блокират графичните ефекти
cs: Povolit aplikacím blokovat kompozici

source: Animation speed:
bg: Скорост на анимация:
cs: Rychlost animace:

source: Very slow
bg: Много бавно
cs: Velmi pomalu

source: Instant
bg: Моментално
cs: Okamžitě

source: Scale method:
bg: Метод на мащабиране:
cs: Metoda škálování:

source: Smooth
bg: Изгладено
cs: Jemná

source: Accurate
bg: Точно
cs: Přesná

source: Tearing prevention ("vsync"):
bg: Предотвратяване на накъсвания ("vsync"):
cs: Zabránění trhání ("VSync"):

source: Automatic
bg: Автоматично
cs: Automaticky

source: Only when cheap
bg: При минимални загуби
cs: Pouze pokud není náročné

source: Full screen repaints
bg: Пренарисуване на целия екран
cs: Překreslení celé obrazovky

source: Re-use screen content
bg: Повторно използване на съдържанието на екрана
cs: Znovu využít obsah obrazovky

source: Keep window thumbnails:
bg: Запазване на миниатюри на прозорец:
cs: Zachovat miniatury oken:

source: Never
bg: Никога
cs: Nikdy

source: Only for Shown Windows
bg: Само за показани прозорци
cs: Pouze pro zobrazená okna

source: Always
bg: Винаги
cs: Vždy

source: Latency:
bg: Забавяне:
cs: Latence:

source: Force lowest latency (may cause dropped frames)
bg: Принудително задаване на най-малко забавяне (може да доведе до отпадане на кадри)

source: Prefer lower latency
bg: Предпочитане на малко забавяне
cs: Preferovat nižší latenci

source: Balance of latency and smoothness
bg: Баланс между забавяне и плавност

source: Prefer smoother animations
bg: Предпочитане на плавни анимации
cs: Preferovat plynulejší animace

source: Force smoothest animations
bg: Принудително задаване на възможно най-плавни анимации
cs: Vynutit nejplynulejší animace

source: Re-enable OpenGL detection
bg: Повторно активиране на откриване на OpenGL
cs: Znovu povolit detekci OpenGL

source: "Only when cheap" only prevents tearing for full screen changes like a video.
bg: "При минимални загуби" предотвратява накъсвания само за графики на цял екран като видео.
cs: "Pouze pokud není náročné" zabrání trhání pouze po změny na celé obrazovce jako třeba při přehrávání videa.

source: "Full screen repaints" can cause performance problems.
bg: "Пренарисуване на целия екран" може да доведе до проблеми с производителността.
cs: "Překreslení celé obrazovky" může způsobit výkonnostní problémy

source: "Re-use screen content" causes severe performance problems on MESA drivers.
bg: "Повторното използване на съдържанието на екрана" причинява сериозни проблеми с производителността на драйверите на MESA.
cs: "Znovu využít obsah obrazovky" způsobuje na ovladačích MESA vážné výkonnostní problémy.
