Repository: KDE/kwin
Catalog: po/*/kcmkwm.po
Languages: cs

source: Inactive Inner Window Actions
cs: Činnosti neaktivního vnitřního okna

source: &Left click:
cs: Kliknutí &levým tlačítkem myši:

source: In this row you can customize left click behavior when clicking into an inactive inner window ('inner' means: not titlebar, not frame).
cs: Zde je možné přizpůsobit chování při kliknutí levým tlačítkem myši na vnitřek neaktivního okna (vnitřkem se myslí bez titulku a rámu).

source: Activate, raise and pass click
cs: Aktivovat, dát do popředí a předat kliknutí

source: Activate and pass click
cs: Aktivovat a předat kliknutí

source: Activate
cs: Aktivovat

source: Activate and raise
cs: Aktivovat a dát do popředí

source: &Middle click:
cs: Kliknutí prostřední&m tlačítkem myši:

source: In this row you can customize middle click behavior when clicking into an inactive inner window ('inner' means: not titlebar, not frame).
cs: Zde je možné přizpůsobit chování při kliknutí prostředním tlačítkem myši na vnitřek neaktivního okna (vnitřkem se myslí bez titulku a rámu).

source: &Right click:
cs: Kliknutí p&ravým tlačítkem myši:

source: In this row you can customize right click behavior when clicking into an inactive inner window ('inner' means: not titlebar, not frame).
cs: Zde je možné přizpůsobit chování při kliknutí pravým tlačítkem myši na vnitřek neaktivního okna (vnitřkem se myslí bez titulku a rámu).

source: Mouse &wheel:
cs: Kolečko m&yši:

source: In this row you can customize behavior when scrolling into an inactive inner window ('inner' means: not titlebar, not frame).
cs: Zde je možné přizpůsobit chování při točení kolečkem myši uvnitř neaktivního okna (vnitřkem se myslí bez titulku a rámu).

source: Scroll
cs: Rolovat

source: Activate and scroll
cs: Aktivovat a rolovat

source: Activate, raise and scroll
cs: Aktivovat, dát do popředí a rolovat

source: Inner Window, Titlebar and Frame Actions
cs: Vnitřní okno, pruh titulku a činnosti rámce

source: Mo&difier key:
cs: Mo&difikátor:

source: Here you select whether holding the Meta key or Alt key will allow you to perform the following actions.
cs: Zde je možné vybrat zda Vám stisknutí klávesu Meta nebo Alt umožní provést následující činnosti.

source: L&eft click:
cs: Kliknutí l&evým tlačítkem myši:

source: In this row you can customize left click behavior when clicking into the titlebar or the frame.
cs: V tomto řádku je možné přizpůsobit chování při kliknutí levým tlačítkem myši na titulek nebo rám.

source: Move
cs: Přesunout

source: Activate, raise and move
cs: Aktivovat, dát do popředí a pohnout

source: Toggle raise and lower
cs: Přepnutí do popředí/pozadí

source: Resize
cs: Změnit velikost

source: Raise
cs: Dát do popředí

source: Lower
cs: Dát do pozadí

source: Minimize
cs: Minimalizovat

source: Decrease opacity
cs: Snížit krytí

source: Increase opacity
cs: Zvýšit krytí

source: Do nothing
cs: Nedělat nic

source: Middle &click:
cs: Kliknutí pro&středním tlačítkem myši

source: In this row you can customize middle click behavior when clicking into the titlebar or the frame.
cs: V tomto řádku je možné přizpůsobit chování při kliknutí prostředním tlačítkem myši na titulek nebo rám.

source: Right clic&k:
cs: &Kliknutí pravým tlačítkem myši

source: In this row you can customize right click behavior when clicking into the titlebar or the frame.
cs: V tomto řádku je možné přizpůsobit chování při kliknutí pravým tlačítkem myši na titulek nebo rám.

source: Mo&use wheel:
cs: Kolečko &myši:

source: Here you can customize KDE's behavior when scrolling with the mouse wheel in a window while pressing the modifier key.
cs: Zde je možné přizpůsobit chování prostředí KDE při rolování kolečka myši při současném držení modifikačního tlačítka.

source: Raise/lower
cs: Do popředí/na pozadí

source: Maximize/restore
cs: Maximalizovat/obnovit

source: Keep above/below
cs: Podržet nad/pod

source: Move to previous/next desktop
cs: Přesunout na předchozí/následující plochu

source: Change opacity
cs: Změnit krytí

source: Window &placement:
cs: U&místění okna:

source: Minimal Overlapping
cs: Minimální překrytí

source: Maximized
cs: Maximalizováno

source: Random
cs: Náhodné

source: Centered
cs: Na střed

source: In Top-Left Corner
cs: V levém horním rohu

source: Under mouse
cs: Pod myší

source: Allow apps to remember the positions of their own windows, if they support it
cs: Povolit aplikacím zapamatovat si pozice vlastních oken, pokud to podporují

source: Virtual Desktop behavior:
cs: Chování virtuální plochy:

source: When activating a window on a different Virtual Desktop:
cs: Při aktivování okna na jiné virtuální ploše:

source: Switch to that Virtual Desktop
cs: Přepnout do této virtuální plochy

source: Bring window to current Virtual Desktop
cs: Přesunout okno do této virtuální plochy

source: Window &activation policy:
cs: Pravidla &aktivace okna:

# sassa asas
source: Click to focus
cs: Klikněte pro zaměření

source: Focus follows mouse
cs: Zaměření následuje myš

source: Focus under mouse
cs: Zaměření pod myší

source: Focus strictly under mouse
cs: Zaměření přesně pod myší

source: &Delay focus by:
cs: Zpoz&dit zaměření o:

source: This is the delay after which the window the mouse pointer is over will automatically receive focus.
cs: Toto je prodleva, po které se přesune okno, nad kterým je ukazatel myši, automaticky navrch.

source: Focus &stealing prevention:
cs: P&revence ztráty zaměření:

source: None
cs: Žádná

source: Low
cs: Nízká

source: Medium
cs: Střední

source: High
cs: Vysoká

source: Extreme
cs: Extrémní

source: Raising windows:
cs: Zdvihání oken:

source: When this option is enabled, the active window will be brought to the front when you click somewhere into the window contents. To change it for inactive windows, you need to change the settings in the Actions tab.
cs: Je-li zapnuta tato volba, tak se okno přesune navrch, kdykoli kliknete myší někam do vnitřku okna. Ke změně tohoto chování pro neaktivní okna je třeba upravit nastavení v kartě 'Činnosti'.

source: &Click raises active window
cs: K&liknutí dá do popředí aktivní okno

source: When this option is enabled, a window in the background will automatically come to the front when the mouse pointer has been over it for some time.
cs: Je-li povoleno automatické dávání do popředí, pak se okno na pozadí automaticky přesune navrch, pokud ukazatel myši nad tímto oknem stráví určitou dobu.

source: &Raise on hover, delayed by:
cs: Dát do popředí při pře&jezdu, se zpožděním:

source: This is the delay after which the window that the mouse pointer is over will automatically come to the front.
cs: Toto je prodleva, po které se přesune okno, nad kterým je ukazatel myši, automaticky navrch.

source: Multiscreen behavior:
cs: Chování více obrazovek:

source: When this option is enabled, focus operations are limited only to the active screen
cs: Pokud je povoleno, operace zaměření jsou omezeny pouze na aktivní obrazovku

source: &Separate screen focus
cs: Odděl&ené zaměření obrazovek

source: Window activation policy description
cs: Popis pravidla aktivování oken

source: &Focus
cs: &Zaměření

source: Titlebar A&ctions
cs: Činnos&ti titulkového pruhu

source: W&indow Actions
cs: Či&nnosti oken

source: Mo&vement
cs: Poh&yb

source: Adva&nced
cs: Pokroči&lé

source: &Titlebar Actions
cs: Činnos&ti titulkového pruhu

source: Window Actio&ns
cs: Či&nnosti oken

source: Titlebar Actions
cs: Činnosti pruhu titulků

source: &Double-click:
cs: &Dvojité kliknutí:

source: Behavior on <em>double</em> click into the titlebar.
cs: Chování při <em>dvojitém</em> kliknutí myší na záhlaví okna.

source: Maximize
cs: Maximalizovat

source: Vertically maximize
cs: Maximalizovat svisle

source: Horizontally maximize
cs: Maximalizovat vodorovně

source: Close
cs: Zavřít

source: Show on all desktops
cs: Zobrazit na všech plochách

source: Behavior on <em>mouse wheel</em> scroll over the titlebar.
cs: Chování při <em>posunu kolečkem myši</em> nad záhlavím okna.

source: Titlebar and Frame Actions
cs: Činnosti titulku a rámu

source: Active
cs: Aktivní

source: Inactive
cs: Neaktivní

source: Behavior on <em>left</em> click into the titlebar or frame of an <em>active</em> window.
cs: Chování při kliknutí <em>levým</em> tlačítkem myši do titulku nebo rámu <em>aktivního</em> okna.

source: Behavior on <em>left</em> click into the titlebar or frame of an <em>inactive</em> window.
cs: Chování při kliknutí <em>levým</em> tlačítkem myši do titulku nebo rámu <em>neaktivního</em> okna.

source: Activate and lower
cs: Aktivovat a dát do pozadí

source: Behavior on <em>left</em> click onto the maximize button.
cs: Chování při <em>levém</em> kliknutí myší na tlačítko pro maximalizaci.

source: Behavior on <em>middle</em> click onto the maximize button.
cs: Chování při <em>prostředním</em> kliknutí myší na tlačítko pro maximalizaci.

source: Middle c&lick:
cs: K&liknutí prostředním tlačítkem myši:

source: Behavior on <em>right</em> click onto the maximize button.
cs: Chování při <em>pravém</em> kliknutí myší na tlačítko pro maximalizaci.

source: Screen &edge snap zone:
cs: Oblast přichyc&ení k okraji obrazovky:

source: Here you can set the snap zone for screen edges, i.e. the 'strength' of the magnetic field which will make windows snap to the border when moved near it.
cs: Zde je možné nastavit zónu přitahování k okrajům obrazovky, tj. 'sílu magnetického pole', které způsobí přitáhnutí okna, je-li blízko okraje.

source: &Window snap zone:
cs: Zóna přitahování &oken:

source: Here you can set the snap zone for windows, i.e. the 'strength' of the magnetic field which will make windows snap to each other when they are moved near another window.
cs: Zde je možné nastavit zónu přitahování k ostatním oknům, tj. 'sílu magnetického pole', které způsobí přitáhnutí okna, je-li blízko jinému oknu.

source: &Center snap zone:
cs: Zóna přita&hování středu:

source: Here you can set the snap zone for the screen center, i.e. the 'strength' of the magnetic field which will make windows snap to the center of the screen when moved near it.
cs: Zde je možné nastavit zónu přitahování ke středu obrazovky, tj. 'sílu magnetického pole', které způsobí přitáhnutí okna, je-li blízko středu.

source: &Snap windows:
cs: &Přitahovat okna:

source: Here you can set that windows will be only snapped if you try to overlap them, i.e. they will not be snapped if the windows comes only near another window or border.
cs: Zde je možné nastavit, že se okna budou přitahovat jen tehdy, budete-li se snažit je dát přes sebe, tj. že se nebudou přitahovat, když okna k sobě navzájem pouze přiblížíte.

source: Only when overlapping
cs: Pouze při překrytí
