{
    "KPlugin": {
        "Category": "Accessibility",
        "Description": "Creates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentations. Activated with a keyboard shortcut",
        "Description[ar]": "ينشئ حركة عندما يُنقَر زر الفأرة. هذا مفيد لتسجيلات الشاشة/العروض التقديمية. تفعّل باختصار لوحة المفاتيح",
        "Description[bg]": "Създава анимация при всяко щракване на бутон на мишката. Това е полезно за екранни записи/презентации. Активирано с клавишна комбинация",
        "Description[ca@valencia]": "Crea una animació quan es clica amb un botó del ratolí. Açò és útil per a gravar la pantalla o en presentacions. Activat amb una drecera de teclat",
        "Description[ca]": "Crea una animació quan es fa clic amb un botó del ratolí. Això és útil per a enregistrar la pantalla o en presentacions. Activat amb una drecera de teclat",
        "Description[da]": "Opretter en animation når der klikkes på en museknap. Dette er brugbart for skærmoptagelser/præsentationer. Aktiveret med en tastaturgenvej",
        "Description[de]": "Erzeugt bei jedem Mausklick eine Animation. Dies ist sinnvoll für Bildschirmaufnahmen oder Präsentationen; mit einem Tastatur-Kurzbefehl ausgelöst",
        "Description[en_GB]": "Creates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentations. Activated with a keyboard shortcut",
        "Description[eo]": "Kreas animacion kiam ajn musbutono estas klakita. Ĉi tio utilas por ekranregistradoj/prezentoj. Aktivigita per klavara ŝparvojo",
        "Description[es]": "Crea una animación cada vez que se pulsa un botón del ratón. Resulta útil durante la grabación de la pantalla y las presentaciones. Se activa con un atajo de teclado.",
        "Description[eu]": "Animazio bat sortzen du saguaren botoi bati klik egiterakoan. Erabilgarria da pantaila-grabaketarako/aurkezpenetarako. Teklatuko lasterbide batekin aktibatua",
        "Description[fi]": "Näyttää animoinnin aina hiiripainiketta napsautettaessa. Avuksi näytöntallennuksissa ja esityksissä. Käynnistyy pikanäppäimellä",
        "Description[fr]": "Crée une animation associée à un clic avec le bouton de la souris. Ceci est utile pour les enregistrements d'écran ou les présentations. Activé grâce à un raccourci clavier.",
        "Description[gl]": "Crea unha animación cando se preme o botón do rato. Isto é útil nas presentacións e nas gravacións da pantalla. Actívase cun atallo de teclado.",
        "Description[he]": "יוצר הנפשה עם כל לחיצה על סמן העכבר. שימושי להסרטות מסך/מצגות. מופעל דרך צירוף מקשי מקלדת",
        "Description[hu]": "Animációt hoz létre, amikor az egérgombbal kattintanak. Ez hasznos a képernyő felvételekor vagy bemutatónál. Gyorsbillentyűvel aktiválható",
        "Description[ia]": "Crea un animation quando un button de mus es pressate. Isto es util pro registrationes de schermo/presentationes. Activate con un via breve de claviero",
        "Description[is]": "Býr til hreyfiáhrif þegar smellt er með músarhnappi. Þetta er gagnlegt í skjáupptöku eða kynningum. Virkjað með flýtilykli",
        "Description[it]": "Crea un'animazione nel momento in cui viene premuto un pulsante del mouse. Ciò è utile per la registrazione dello schermo o per le presentazioni. Attivato con una scorciatoia da tastiera",
        "Description[ka]": "ქმნის ანიმაციას, როცა თაგუნას ღილაკს დააწკაპუნებთ. სასარგებლოა ეკრანის ჩაწერისას/პრეზენტაციებისას. აქტიურდება კლავიატურის მალსახმობით",
        "Description[ko]": "마우스 단추를 클릭했을 때 애니메이션을 표시합니다. 화면 녹화/프레젠테이션에서 유용합니다. 키보드 단축키로 활성화합니다",
        "Description[lt]": "Rodo animaciją kas kartą, kai yra paspaudžiamas pelės mygtukas. Tai naudinga filmuojant ekraną ar rodant pateiktis. Aktyvinama naudojant sparčiuosius klavišus",
        "Description[lv]": "Izveido animāciju, kad noklikšķina peles pogu. Noderīgi ekrāna ierakstiem/prezentācijām. Aktivizē ar tastatūras saīsni",
        "Description[nb]": "Lager en animasjon hver gang en museknapp trykkes ned. Dette er nyttig for skjermopptak/presentasjoner – slått av/på med hurtigtast",
        "Description[nl]": "Maakt een animatie wanneer op een muisknop wordt geklikt. Dit is nuttig voor schermopnamen/presentaties. Geactiveerd met een sneltoets",
        "Description[nn]": "Lagar ein animasjon kvar gong ein museknapp vert trykt ned. Dette er nyttig for skjermopptak/presentasjonar. Slått på/av med snøggtast.",
        "Description[pl]": "Tworzy animację przy każdym kliknięciu klawiszem myszy. Jest to użyteczne przy nagrywaniu ekranu/prezentacjach. Włączane skrótem klawiszowym",
        "Description[pt_BR]": "Cria uma animação cada vez que o botão do mouse é clicado. Isso é útil para apresentações/gravações de tela; ativado com um atalho de teclado",
        "Description[ro]": "Creează o animație ori de câte ori e apăsat un buton al șoricelului. Util pentru înregistrări de ecran și prezentări. Activat cu o scurtătură de taste",
        "Description[ru]": "Создание анимации при каждом щелчке мышью. Это удобно для записи видео с экрана и для презентаций. Активируется нажатием комбинации клавиш",
        "Description[sa]": "यदा कदापि मूषकस्य बटन् क्लिक् भवति तदा एनिमेशनं निर्माति । एतत् स्क्रीनरेकर्डिङ्ग्/प्रस्तुतिषु उपयोगी भवति । कीबोर्ड-शॉर्टकट्-सहितं सक्रियम्",
        "Description[sl]": "Ustvari animacijo, ko kliknete miškin gumb. To je koristno za posnetke zaslona/predstavitve. Aktivirano z bližnjico tipkovnice",
        "Description[sv]": "Skapar en animering så fort en musknapp klickas. Det är användbart för skärminspelningar och presentationer. Aktiveras med en snabbtangent",
        "Description[tr]": "Ne zaman bir fare düğmesi tıklansa bir canlandırma oluşturur. Bu ekran kaydı ve sunumlar için yararlıdır; klavye kısayoluyla etkinleştirilir",
        "Description[uk]": "Створення анімацій у відповідь на клацання кнопкою миші. Корисне для записів демонстрацій та презентацій. Активується клавіатурним скороченням",
        "Description[zh_CN]": "鼠标按键按下时显示动效，在进行录屏演示时非常有用；使用键盘快捷键激活",
        "Description[zh_TW]": "點擊滑鼠按鍵時顯示一個動畫。這在螢幕錄影或投影片播放時很有用。——需要用鍵盤快捷鍵觸發",
        "EnabledByDefault": false,
        "License": "GPL",
        "Name": "Mouse Click Animation",
        "Name[ar]": "حركة نقرة الفأرة",
        "Name[az]": "Siçan kliki animasiyası",
        "Name[be]": "Анімацыя пстрыкання мышшу",
        "Name[bg]": "Анимация на щракванията с мишка",
        "Name[ca@valencia]": "Animació quan es clique amb el ratolí",
        "Name[ca]": "Animació en fer clic amb el ratolí",
        "Name[cs]": "Animace kliknutí myši",
        "Name[da]": "Animation for museklik",
        "Name[de]": "Animation für Mausklicks",
        "Name[en_GB]": "Mouse Click Animation",
        "Name[eo]": "Musklaka Animacio",
        "Name[es]": "Animación del clic del ratón",
        "Name[et]": "Hiireklõpsu animeerimine",
        "Name[eu]": "Sagu-klikaren animazioa",
        "Name[fi]": "Hiiren napsautuksen animointi",
        "Name[fr]": "Animation du clic de la souris",
        "Name[gl]": "Animación ao premer o rato",
        "Name[he]": "הנפשת לחיצת עכבר",
        "Name[hu]": "Egérkattintási animáció",
        "Name[ia]": "Animation de click de mus",
        "Name[id]": "Animasi Klik Mouse",
        "Name[is]": "Hreyfiáhrif við músarsmell",
        "Name[it]": "Animazione del clic del mouse",
        "Name[ja]": "マウスクリックのアニメーション",
        "Name[ka]": "თაგუნას წკაპის ანიმაცია",
        "Name[ko]": "마우스 클릭 애니메이션",
        "Name[lt]": "Pelės spustelėjimo animacija",
        "Name[lv]": "Peles klikšķa animācija",
        "Name[nb]": "Museklikkanimasjon",
        "Name[nl]": "Animatie van muisklik",
        "Name[nn]": "Museklikkanimasjon",
        "Name[pl]": "Animacja kliknięcia myszą",
        "Name[pt]": "Animação do Botão do Rato",
        "Name[pt_BR]": "Animação de clique do mouse",
        "Name[ro]": "Animație la clic de maus",
        "Name[ru]": "Анимация щелчка мышью",
        "Name[sa]": "माउस क्लिक् एनिमेशन",
        "Name[sk]": "Animácia kliknutia myšou",
        "Name[sl]": "Animacija klika z miško",
        "Name[sv]": "Animering av musklick",
        "Name[ta]": "சுட்டி கிளிக் அசைவூட்டம்",
        "Name[tr]": "Fare Tıklama Canlandırması",
        "Name[uk]": "Анімація за клацанням миші",
        "Name[vi]": "Hiệu ứng động khi bấm chuột",
        "Name[zh_CN]": "鼠标点击动效",
        "Name[zh_TW]": "滑鼠點擊動畫"
    },
    "X-KDE-ConfigModule": "kwin_mouseclick_config"
}
