{
    "KPlugin": {
        "Category": "Accessibility",
        "Description": "Creates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentations",
        "Description[ar]": "ينشئ حركة عندما يُنقَر زر الفأرة. هذا مفيد لتسجيلات الشاشة/العروض التقديمية",
        "Description[az]": "Hər siçan düyməsini vurduqda animaisya yaradır. Bu adətən ekrandan video yazdıqda və ya təqdimat üçün istifadə olunur.",
        "Description[ca@valencia]": "Crea una animació quan es fa clic amb un botó del ratolí. Això és útil per a enregistrar la pantalla o en presentacions",
        "Description[ca]": "Crea una animació quan es fa clic amb un botó del ratolí. Això és útil per a enregistrar la pantalla o en presentacions",
        "Description[cs]": "Vytvoří animaci při každém kliknutí myši. Toto je užitečné pro nahrávání obrazovky nebo prezentace",
        "Description[en_GB]": "Creates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentations",
        "Description[es]": "Crea una animación cada vez que se pulsa un botón del ratón. Resulta útil durante la grabación de la pantalla y las presentaciones.",
        "Description[fi]": "Toteuttaa animoinnin aina hiiripainiketta napsautettaessa näyttötallenteiden ja esitysten avuksi.",
        "Description[fr]": "Crée une animation associée à un clic sur un bouton de la souris. Ceci est utile pour les enregistrements d'écran ou les présentations.",
        "Description[hu]": "Animációt hoz létre, amikor az egérgombbal kattintanak. Ez hasznos a képernyő felvételekor vagy bemutatónál",
        "Description[ia]": "Crea un animation quando un button de mus es pressate. Isto es util pro registrationes de schermo/presentationes",
        "Description[it]": "Crea un'animazione nel momento in cui viene premuto un pulsante del mouse. Ciò è utile per la registrazione dello schermo o per le presentazioni.",
        "Description[ko]": "마우스 단추를 눌렀을 때 애니메이션을 표시합니다. 화면 녹화/프레젠테이션에서 유용합니다",
        "Description[nl]": "Maakt een animatie wanneer op een muisknop wordt geklikt. Dit is nuttig voor schermopnamen/presentaties",
        "Description[nn]": "Lagar ein animasjon kvar gong ein museknapp vert trykt ned. Dette er nyttig for skjermopptak/presentasjonar.",
        "Description[pl]": "Tworzy animację przy każdym kliknięciu klawiszem myszy. Jest to użyteczne przy nagrywaniu ekranu/prezentacjach",
        "Description[pt_BR]": "Cria uma animação cada vez que o botão do mouse é clicado. Isso é útil para apresentações/gravações de tela",
        "Description[ru]": "Создание анимации, отмечающую щелчки мышью. Это удобно для записи видео с экрана и для презентаций.",
        "Description[sk]": "Vytvorí animáciu vždy, keď sa klikne tlačidlom myši. Toto je užitočné pre prezentácie a záznamy obrazoviek",
        "Description[sl]": "Ustvari animacijo, ko kliknete miškin gumb. To je koristno za posnetke zaslona oz. predstavitve",
        "Description[sv]": "Skapar en animering så fort en musknapp klickas. Det är användbart för skärminspelningar och presentationer",
        "Description[uk]": "Створення анімацій у відповідь на клацання кнопкою миші. Корисне для записів демонстрацій та презентацій.",
        "Description[x-test]": "xxCreates an animation whenever a mouse button is clicked. This is useful for screenrecordings/presentationsxx",
        "Description[zh_CN]": "鼠标按键按下时显示动效，在进行录屏演示时非常有用",
        "EnabledByDefault": false,
        "Id": "mouseclick",
        "License": "GPL",
        "Name": "Mouse Click Animation",
        "Name[ar]": "حركة نقرة الفأرة",
        "Name[az]": "Siçan kliki animasiyası",
        "Name[ca@valencia]": "Animació en fer clic amb el ratolí",
        "Name[ca]": "Animació en fer clic amb el ratolí",
        "Name[cs]": "Animace kliknutí myši",
        "Name[en_GB]": "Mouse Click Animation",
        "Name[es]": "Animación del clic del ratón",
        "Name[fi]": "Hiiren napsautuksen animointi",
        "Name[fr]": "Animation du clic de la souris",
        "Name[hu]": "Egérkattintási animáció",
        "Name[ia]": "Animation de click de mus",
        "Name[it]": "Animazione del clic del mouse",
        "Name[ko]": "마우스 클릭 애니메이션",
        "Name[nl]": "Animatie van muisklik",
        "Name[nn]": "Museklikkanimasjon",
        "Name[pl]": "Animacja kliknięcia myszą",
        "Name[pt]": "Animação do Botão do Rato",
        "Name[pt_BR]": "Animação de clique do mouse",
        "Name[ru]": "Анимация щелчка мышью",
        "Name[sk]": "Animácia kliknutia myšou",
        "Name[sl]": "Animacija klika z miško",
        "Name[sv]": "Animering av musklick",
        "Name[uk]": "Анімація за клацанням миші",
        "Name[x-test]": "xxMouse Click Animationxx",
        "Name[zh_CN]": "鼠标点击动效"
    },
    "X-KDE-ConfigModule": "kwin_mouseclick_config",
    "org.kde.kwin.effect": {
        "video": "https://files.kde.org/plasma/kwin/effect-videos/mouse_click.mp4"
    }
}
